{
  "Logo": {
    "subtext": "Colby Birkheadの個人サイト"
  },
  "IntroductionSection": {
    "header": "<em>コービー</em>と申します",
    "body": "ネット上でおもしろいものを作っているつもりです"
  },
  "ProjectsSection": {
    "header": "<em>recent projects</em>"
  },
  "ContactSection": {
    "header": "<em>contact</em>",
    "leave-a-comment": "またはここでで気軽になにか書き残していただければと",
    "view-resume": "レジメを見る"
  },
  "AboutSection": {
    "header": "<em>about</em>",
    "AboutThisSite": {
      "tab": "本サイト",
      "header": "about this site",
      "body": "このサイトはReactとNextJSで作られています. 主な役割は、私のプロジェクトを紹介することです\n\n興味があれば<srcCodeLink>こちらで</srcCodeLink>ソースコードをご覧いただくこともできます。",
      "colorTheme": {
        "header": "color theme",
        "body": "とある携帯ゲーム機を使って育った方ならば、本サイトで選択できる配色になにか見覚えがあるでしょう。\n\nその「とある携帯ゲーム機」は元々、「色」の機能がついておらず、緑っぽい画面に4つくらいの濃淡を表すことしかできませんでした。\n\nしかし、後に発売されたカラーバージョンでは、古い白黒（緑黒）ソフトを起動すると、どうなるかというと、あるテーマによって色が割り当てられます。\n\nそのテーマも選ぶこともできますが、本サイトで選ばれる配色がそのときのテーマを再現したものです。\n\nそれらの配色の中には、いくつか刺激的なものも確かに含まれていますが、それを責めるなら私ではなく、ニンテっ、いや、ここでは名を挙げない、とあるゲーム会社にしてください。"
      },
      "dithering": {
        "header": "dithering effect",
        "body": {
          "1": "同上ゲーム機で見られるもう一つの機能、「ディザリング効果」というのを実装したかったです。\n\nディザリングとは、制約されたカラーパレットを使っている上で、二つの異なる色をずらして配置することによって、別の色やシェードを作り出す技術です。\n\nこれは、さまざまなパターンで点を配置することで、特定の色やシェードを表現する「点描法」にも似ています。\n\n当期のゲーム機では、ハードウェアの制限で使える色彩が非常に限られているのに、絵をより豊かに表示するのによく利用された現象です。",
          "2": "本サイトでも、表示されるすべての画像をアルゴリズムに通して、当時の絵に見せかけています。まずは少々ぼかされ、グレースケールに変換します。",
          "3": "次に、はっきりとした4色に分けます",
          "4": "現在選択されているテーマに切り替えます",  
          "5": "そして最後に、境目に近い領域に単純なチェッカーボードパターンをかけることによって、「ディザリング効果」を適用します",
          "6": "（実際のアルゴリズムでは、パフォーマンスのため順番通りではなく同時に行われますが、だいたいこのように絵を処理します）\n\n私自身が言うのもなんですが、初期のビデオゲーム画像をよく真似した写真ができると思います。\n\nこのアルゴリズムがリアルタイムで実行されるため、プロジェクトページに表示される画像など、外部のAPIから取得したものも処理できるのがポイントです。"
        }
      }
      
    },
    "AboutColby": {
      "tab": "作者",
      "header": "about colby",
      "body": "私はColby Birkheadといいます。アメリカ人ですけど、日本に行ったまま帰ってこない模様です。\n\n趣味はコンピューター、ゲーム、読書などです。\n\n高卒後、日本の文化に興味を持つようになって、その魅力に惹かれました。日本語を勉強し始めて三年、文部科学省の奨学金をもらって、日本で大学生として五年間生活する機会をいただきました。\n\n日本に住んでいる間、妻と出会って、名古屋大学文学部を卒業して、次は韓国に行って小規模のビジネスを起業して、娘の誕生で家族も作りました。\n\n大卒後、プログラミングの勉強を再開して、将来ソフトウェア業界に転職しようと思っています。\n\nご興味があればぜひ <resumeLink>こちらで</resumeLink>私のレジメを御覧になってください。または <contactMeLink>こちらで</contactMeLink>ご連絡いただければと思います。"
    },
    "AboutColbysWork": {
      "tab": "作者の活動",
      "header": "about colby's work",
      "body": "小さいころから、パソコンやプログラミングに関心をずっと持っています。\n\n子供用ノートパソコンでBASICを学び、ゲームを遊ぶときは、ゲーム自体よりステージ作りなどのほうで時間をつぶしてました。\n\n高校では、PERL、Python、そしてウェブ開発（HTML、CSS、JavaScript）を勉強しました。\n\n大卒後、Unreal EngineやUnityを学んで、C#でスクリプトを書くことによってプログラミングの楽しさを思い出しました。\n\n今はウェブ開発を主としてアプリケーションを作りながら勉強していて、ゲーム開発にもしばしば手を出しています。自分の仕事のためのアプリも何個か作っています。\n\n<projectsLink>こちらで</projectsLink>私が作ったものを展示していますので、興味があればぜひ！"
    }
  },
  "AboutMyWorkSection": {
    "header": "<em>programming</em>",
    "body": "小さいころから、パソコンやプログラミングに関心をずっと持っています。最初はおもちゃノートパソコンで<em>BASIC</em>を書いていました。\n\nゲームが好きで、拡張スクリプトを書いたり、自作ステージを作ったりしていました。のちに、<em>Unity</em>や<em>Unreal</em>などのゲームエンジンで自分のゲームを作るようにもなりました。\n\n今は主に<em>ウェブ開発</em>に集中しながら、たまに<em>ゲームジャム</em>にも参加します。\n\n様々な言語やフレームワークを勉強してきましたが、今は基本的に<em>React</em>と<em>NestJS</em>でフルスタックアプリを作ることにしています. <em>AWS</em>のサービスもよく利用しています。"
  }
}